Revit 2024 API
Alignment.GUID Property
 The GUID of this alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public Guid GUID { get; }
Visual Basic
Public ReadOnly Property GUID As Guid
	Get
Visual C++
public:
property Guid GUID {
	Guid get ();
}
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace